[
    {
        "id": 1,
        "title": "Stranger Things",
        "year": 2016,
        "poster": "https://www.goha.ru/s/A:NJ/5g/TOXv6GcVnc.jpg",
        "director": "Shon Levi",
        "rating": 8.7,
        "description": "Дії серіалу відбуваються в листопаді 1983 року в невеликому провінційному містечку Хоукінс, розташованому в штаті Індіана, де в місцевій лабораторії, що належить департаменту енергетики США, таємниче пропадає один із співробітників.",
        "genre": "Drama",
        "actors": [
            "Millie Bobby Brown",
            "Finn Wolfhard",
            "Gaten Matarazzo",
            "Caleb McLaughlin",
            "Noah Schnapp"
        ],
        "trailer": "https://youtu.be/b9EkMc79ZSU"
    },
    {
        "id": 2,
        "title": "Little Women",
        "year": 2019,
        "poster": "https://i.pinimg.com/originals/4f/8d/e1/4f8de1ec6a7a0b90350b3796aaa6762d.jpg",
        "director": "Greta Gervin",
        "rating": 7.8,
        "description": "Сюжет картини, заснований на однойменному романі Луїзи Мей Олкотт, розвивається за часів Громадянської війни США навколо взаємовідносин чотирьох сестер. Джо — письменниця-початківець і справжній шибеник, що віддає перевагу суспільству хлопчиків. Мег — відповідальна, жіночна та романтична красуня, яка мріє про багате життя. Бет — скромна та соромлива дівчина, яка хоче присвятити життя музиці.",
        "genre": "Biography",
        "actors": [
            "Saoirse Ronan",
            "Emma Watson",
            "Florence Pugh",
            "Eliza Scanlen",
            "Laura Dern"
        ],
        "trailer": "https://youtu.be/AST2-4db4ic"
    },
    {
        "id": 3,
        "title": "The Notebook",
        "year": 2004,
        "poster": "https://m.media-amazon.com/images/M/MV5BMTk3OTM5Njg5M15BMl5BanBnXkFtZTYwMzA0ODI3._V1_.jpg",
        "director": "Nick Cassavetes",
        "rating": 8.25,
        "description": "17-річна Еллі Гамільтон із багатої родини проводить літні канікули у Сібруку, де знайомиться з місцевим хлопцем Ноєм на карнавалі. Незабаром вони закохуються одна в одну. Батьки Еллі не схвалюють їхній роман і повертаються до Нью-Йорка. Ной пише по одному листа на день протягом року для Еллі, але її мати їх не доставляє їх. Через три роки США вступають у Другу світову війну, Ной і його найкращий друг Фін записуються в армію, а Еллі працює армійською медсестрою.",
        "genre": "Love story",
        "actors": [
            "Ryan Gosling",
            "Rachel McAdams"
        ],
        "trailer": "https://youtu.be/FC6biTjEyZw"
    },
    {
        "id": 4,
        "title": "The Queen's Gambit",
        "year": 2020,
        "poster": "https://m.media-amazon.com/images/M/MV5BM2EwMmRhMmUtMzBmMS00ZDQ3LTg4OGEtNjlkODk3ZTMxMmJlXkEyXkFqcGdeQXVyMjM5ODk1NDU@._V1_.jpg",
        "director": "Scott Frank",
        "rating": 8.29,
        "description": "Події серіалу, заснованого на однойменному творі американського письменника Уолтера Тевіса, розгортаються навколо Бет Хармон, яка опинилася в дитячому притулку в Кентуккі після того, як у її родині сталася трагедія. Будучи замкнутою і похмурою дівчинкою, Бет випадково відкрила в собі дивовижну здатність до гри в шахи, а також непомітно звикла до транквілізаторів, які використовували в притулку як заспокійливий засіб для дітей. Переслідувана особистими демонами і опинившись на слизькому шляху наркозалежності, героїня вступає у доросле життя з єдиною метою — досягти успіху у світі шахів, де домінують чоловіки.",
        "genre": "Historical drama",
        "actors": [
            "Anya Taylor-Joy",
            "Marielle Heller",
            "Moses Ingram"
        ],
        "trailer": "https://youtu.be/oZn3qSgmLqI"
    },
    {
        "id": 5,
        "title": "Intouchables ",
        "year": 2012,
        "poster": "https://upload.wikimedia.org/wikipedia/ru/b/b9/Intouchables.jpg",
        "director": "Olivier Nakach",
        "rating": 8.80,
        "description": "Філіп дуже багата людина, але внаслідок нещасного випадку його паралізувало, і він прикутий до інвалідного крісла. Він втратив будь-який інтерес до життя, і потребує постійного нагляду. Для цих цілей наймаються доглядальниці, проте жодна з них довго не працює.І ось одного разу черговою доглядальницею Пилипа стає чорношкірий молодий хлопець на ім'я Дрісса, який вийшов зовсім недавно з в'язниці.",
        "genre": "Comedy/Drama",
        "actors": [
            "François Cluzet",
            "Omar Sy"
        ],
        "trailer": "https://youtu.be/34WIbmXkewU"
    },
    {
        "id": 6,
        "title": "Me Before You",
        "year": 2016,
        "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2NjE4NDE2NV5BMl5BanBnXkFtZTgwOTcwNDE5NzE@._V1_.jpg",
        "director": "Thea Sharrock",
        "rating": 7.4,
        "description": "Якось заповзятливий молодий банкір Вільям Трейнор, який перебуває у добрих стосунках зі своєю дівчиною Алісією, потрапляє в аварію і виявляється паралізованим нижче за шию, маючи можливість пересуватися лише на дорогому інвалідному кріслі. Через два роки чоловік остаточно втрачає віру в життя, незважаючи на підтримку своєї сім'ї і свого асистента Натана. У цей складний період його новою доглядальницею стає активна та життєрадісна Луїза Кларк. 26-річна дівчина зачаровує головного героя своєю красою та безпосередністю, спонукавши запросити її на побачення.",
        "genre": "Romance",
        "actors": [
            "Emilia Clarke",
            "Sam Claflin"
        ],
        "trailer": "https://youtu.be/Eh993__rOxA"
    },
    {
        "id": 7,
        "title": "Sherlock",
        "year": 2010,
        "poster": "https://uaserial.com/images/seasons/63/63c02277e2988126486153.webp",
        "director": "Mark Gatiss",
        "rating": 9.1,
        "description": "Вільна інтерпретація циклу культових оповідань про геніального британського детектива, де цього разу події переносяться у XXI століття. За сюжетом військовий лікар Джон Ватсон, після служби в Афганістані страждає від болю в нозі, повертається до Лондона, де підшукує собі потрібну квартиру. Він зупиняється на Бейкер-стріт у добродушній місіс Хадсон разом із проникливим детективом на ім'я Шерлок Холмс. Використовуючи методи спостереження, аналізу, дедукції та застосовуючи сучасні технології, вони допомагають столичній поліції розкривати найскладніші справи.",
        "genre": "Crime",
        "actors": [
            "Benedict Cumberbatch",
            "Martin Freeman"
        ],
        "trailer": "https://youtu.be/xK7S9mrFWL4"
    },
    {
        "id": 8,
        "title": "The Vampire Diaries",
        "year": 2009,
        "poster": "https://flxt.tmsimg.com/assets/p13004312_b_v8_au.jpg",
        "director": "Kevin Meade Williamson",
        "rating": 7.7,
        "description": "Через кілька місяців після аварії, в якій загинули їхні батьки, Олена та Джеремі переїжджають до тітки і намагаються повернутися до звичайного шкільного життя. На початку вересня всі старшокласниці, в тому числі й Олена, звертають увагу на загадкового новачка Стефана Сальваторе. Проте дівчина не здогадується, що Стефан — вампір, який нещодавно повернувся до рідного Містіка Фоллза. Слідом за ним пішов і його брат Деймон, який сіє хаос і кровожерно розправляється із жертвами. Небезпечний вампір відразу звертає увагу на Олену, в яку закохався його брат, і вирішує помститися за стару образу.",
        "genre": "Romance",
        "actors": [
            "Paul Wesley",
            "Ian Somerhalder",
            "Nina Dobrev"
        ],
        "trailer": "https://youtu.be/BmVmhjjkN4E"
    },
    {
        "id": 9,
        "title": "Dark",
        "year": 2017,
        "poster": "https://www.crew-united.com/Media/Images/990/990559/990559.entity.jpg",
        "director": "Baran bo Odar",
        "rating": 8.10,
        "description": "Протягом довгих років людство вірило, що час сам собою лінійний, однорідний і нескінченний, і в цьому нескінченному потоці завжди є минуле, сучасне і майбутнє. А якщо це не так? Що якщо вчора, сьогодні і завтра - зовсім не послідовність, а створена ще в давнину ілюзія, що приховує від нашого розуму глибший зміст... Дія серіалу розгортається в невеликому провінційному містечку Вінден, розташованому в лісовій глушині неподалік атомної електростанції. У центрі сюжету опиняється група місцевих жителів, які вкрай занепокоєні безслідним зникненням підлітка та несподіваним самогубством старанного сім'янина, яке сталося через кілька днів. Що ж це: не пов'язані між собою трагічні події чи відлуння таємничих подій, що відбулися в далекому минулому, про які багато хто весь цей час намагався забути?",
        "genre": "Detective movie",
        "actors": [
            "Louis Hofmann",
            "Karoline Eichhorn"
        ],
        "trailer": "https://youtu.be/ESEUoa-mz2c"
    },
    {
        "id": 10,
        "title": "Meet Joe Black",
        "year": 1998,
        "poster": "https://upload.wikimedia.org/wikipedia/ru/1/1c/%D0%97%D0%BD%D0%B0%D0%BA%D0%BE%D0%BC%D1%8C%D1%82%D0%B5%D1%81%D1%8C%2C_%D0%94%D0%B6%D0%BE_%D0%91%D0%BB%D1%8D%D0%BA.jpg",
        "director": "Martin Brest",
        "rating": 7.2,
        "description": "У будинку людини на ім'я Вільям Періш, що є газетним магнатом, напередодні його 65-го дня народження з'являється загадковий юнак, який називає себе Джо Блек. Як незабаром з'ясовується цей таємничий хлопець не хто інший, як сама Смерть, яка прийняла людську подобу. Справа в тому, що Смерть втомилася від своєї рутинної роботи, і вирішила зробити собі відпустку. Ангел смерті пропонує Перішові угоду - стати його провідником у світі живих на час відпустки, після якого він забере Вільяма з собою, адже його час настав. Однак Смерть навіть подумати не могла, чим обернеться для неї час, проведений на Землі.",
        "genre": "Romance/Fantasy",
        "actors": [
            "Brad Pitt",
            "Claire Forlani"
        ],
        "trailer": "https://youtu.be/_zIOjl93WrU"
    }
]